app/workers/expired_diaries_worker.rb

DELETE FROM "diaries" WHERE "diaries"."id" = $1  [["id", 1]]
SELECT "diaries".* FROM "diaries" WHERE "diaries"."kind" = $1 AND (expiration <= '2021-04-20 04:34:30.197273')  [["kind", 1]]
---
  def perform
    diaries = Diary.where(
      kind: :personal
    ).where(
      "expiration <= ?", DateTime.current #Time.now.in_time_zone
    ).destroy_all