app/workers/expired_diaries_worker.rb

  def perform
    diaries = Diary.all

    diaries.each do |diary|
---
SELECT "diaries".* FROM "diaries"