app/controllers/crud/diaries_crud_controller.rb

SELECT "diaries".* FROM "diaries"
---
    def index
      @diaries = Diary.all

SELECT "diaries".* FROM "diaries" WHERE "diaries"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
      @diaries = Diary.find(params[:id])

INSERT INTO "diaries" ("title", "expiration", "kind", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "sdg"], ["expiration", "2021-04-26 00:00:00"], ["kind", 1], ["created_at", "2021-04-23 20:56:09.187740"], ["updated_at", "2021-04-23 20:56:09.187740"]]
---
    def create
      @diary = Diary.new(diary_params)

      if @diary.save

SELECT "diaries".* FROM "diaries" WHERE "diaries"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def edit
      @diary = Diary.find(params[:id])