app/controllers/api/v1/diaries_api_controller.rb

SELECT "diaries".* FROM "diaries" ORDER BY created_at DESC
---
      def index
        diaries = Diary.order('created_at DESC')