app/controllers/api/v1/diaries_controller.rb

      def index
        diaries = Diary.order('created_at DESC')
---
SELECT "diaries".* FROM "diaries" ORDER BY created_at DESC

      def show
        diary = Diary.find(params[:id])
---
SELECT "diaries".* FROM "diaries" WHERE "diaries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

      def create
        diary = Diary.new(diary_params)

        if diary.save
---
INSERT INTO "diaries" ("title", "expiration", "kind", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "An Evil Cradling"], ["expiration", "2021-04-18 00:00:00"], ["kind", 1], ["created_at", "2021-04-17 17:28:41.066329"], ["updated_at", "2021-04-17 17:28:41.066329"]]

      def destroy
        diary = Diary.find(params[:id])
        diary.destroy
---
SELECT "diaries".* FROM "diaries" WHERE "diaries"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
DELETE FROM "diaries" WHERE "diaries"."id" = $1  [["id", 1]]