app/controllers/api/v1/notes_api_controller.rb

      def index
        notes = Note.order('created_at DESC')
---
SELECT "notes".* FROM "notes" ORDER BY created_at DESC