app/controllers/api/v1/notes_controller.rb

      def index
        notes = Note.order('created_at DESC')
---
SELECT "notes".* FROM "notes" ORDER BY created_at DESC

      def create
        note = Note.new(note_params)

        if note.save
---
INSERT INTO "notes" ("text", "diary_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "sdgksdghkdsg"], ["diary_id", 3], ["created_at", "2021-04-20 03:57:32.137407"], ["updated_at", "2021-04-20 03:57:32.137407"]]

      def destroy
        note = Note.find(params[:id])
        note.destroy
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 1]]